{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "227756a27cbf47e3",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:50.215000400Z",
     "start_time": "2024-11-05T15:21:50.009001600Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Windows\n",
      "11\n",
      "AMD64\n",
      "Intel64 Family 6 Model 154 Stepping 3, GenuineIntel\n",
      "20\n",
      "scpufreq(current=2300.0, min=0.0, max=2300.0)\n",
      "svmem(total=16890978304, available=6334627840, percent=62.5, used=10556350464, free=6334627840)\n"
     ]
    }
   ],
   "source": [
    "import psutil\n",
    "import platform\n",
    "\n",
    "print(platform.system())  # 操作系统名称\n",
    "print(platform.release())  # 操作系统版本\n",
    "print(platform.machine())  # 计算机架构\n",
    "print(platform.processor())  # 处理器类型\n",
    "\n",
    "# CPU 信息\n",
    "print(psutil.cpu_count())  # CPU 核数\n",
    "print(psutil.cpu_freq())  # CPU 频率\n",
    "\n",
    "# 内存信息\n",
    "print(psutil.virtual_memory())  # 内存总量、可用内存、已用内存等"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "initial_id",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:50.594838200Z",
     "start_time": "2024-11-05T15:21:50.027997800Z"
    },
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "import warnings\n",
    "warnings.filterwarnings('ignore')\n",
    "from neo4j import GraphDatabase\n",
    "# URI examples: \"neo4j://localhost\", \"neo4j+s://xxx.databases.neo4j.io\"\n",
    "URI = \"neo4j://localhost\"\n",
    "AUTH = (\"neo4j\", \"12345678\")\n",
    "\n",
    "driver = GraphDatabase.driver(URI, auth=AUTH)\n",
    "\n",
    "session = driver.session(database=\"example\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "e95b548caf3a6832",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:54.735041800Z",
     "start_time": "2024-11-05T15:21:50.594838200Z"
    },
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "session.run(\"MATCH (n) DETACH DELETE n\")\n",
    "def print_nodes():\n",
    "    results = session.run(\"MATCH (n) RETURN *\")\n",
    "    for record in results:\n",
    "        print(record.data())\n",
    "def print_relationships():\n",
    "    results = session.run(\"MATCH (n1)-[r]->(n2) RETURN n1, r, n2\")\n",
    "    for record in results:\n",
    "        print(record.data())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "b9b9db9b8a4246de",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:54.751547Z",
     "start_time": "2024-11-05T15:21:54.736030Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x1ea8b36ffa0>"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "session.run(\"CREATE (charlie:Person:Actor {name: 'Charlie Sheen'}), (oliver:Person:Director {name: 'Oliver Stone'})\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "1bc869dfd9a2d9ca",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:54.804557Z",
     "start_time": "2024-11-05T15:21:54.751547Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x1ea8b3a5d60>"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "session.run(\"\"\"CREATE (charlie:Person:Actor {name: 'Charlie Sheen'})-[:ACTED_IN {role: 'Bud Fox'}]\n",
    "        ->(wallStreet:Movie {title: 'Wall Street'})<-\n",
    "        [:DIRECTED]-(oliver:Person:Director {name: 'Oliver Stone'})\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "fc218e21637eb929",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:54.805551900Z",
     "start_time": "2024-11-05T15:21:54.767542900Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'n': {'title': 'Wall Street'}}\n",
      "{'n': {'name': 'Oliver Stone'}}\n",
      "{'n': {'name': 'Charlie Sheen'}}\n",
      "{'n': {'name': 'Oliver Stone'}}\n",
      "{'n': {'name': 'Charlie Sheen'}}\n"
     ]
    }
   ],
   "source": [
    "results = session.run(\"MATCH (n) RETURN n\")\n",
    "for record in results:\n",
    "    print(record.data())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "4312bbc272b7eeaf",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:54.821695700Z",
     "start_time": "2024-11-05T15:21:54.796543Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'movie': {'title': 'Wall Street'}}]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = session.run(\"MATCH (movie:Movie) RETURN movie\")\n",
    "results.data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "6331b1737a370b01",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:54.910695400Z",
     "start_time": "2024-11-05T15:21:54.813695500Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x1ea8b385160>"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "session.run(\"MATCH (n) DETACH DELETE n\")\n",
    "session.run(\"CREATE (charlie:Person:Actor {name: 'Charlie Sheen'}), (oliver:Person:Director {name: 'Oliver Stone'})\")\n",
    "session.run(\"\"\"MATCH (charlie:Person {name: 'Charlie Sheen'}), (oliver:Person {name: 'Oliver Stone'})\n",
    "CREATE (charlie)-[:ACTED_IN {role: 'Bud Fox'}]->(wallStreet:Movie {title: 'Wall Street'})<-[:DIRECTED]-(oliver)\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "f2050e28505e7a24",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:54.913696700Z",
     "start_time": "2024-11-05T15:21:54.843697400Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x1ea8b3de880>"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "session.run(\"MATCH (n) DETACH DELETE n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "cfd5a5375716c78e",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:54.914696500Z",
     "start_time": "2024-11-05T15:21:54.859694800Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x1ea8b3def40>"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "session.run(\"\"\"CREATE\n",
    "  (keanu:Person {name: 'Keanu Reever'}),\n",
    "  (laurence:Person {name: 'Laurence Fishburne'}),\n",
    "  (carrie:Person {name: 'Carrie-Anne Moss'}),\n",
    "  (tom:Person {name: 'Tom Hanks'}),\n",
    "  (theMatrix:Movie {title: 'The Matrix'}),\n",
    "  (keanu)-[:ACTED_IN]->(theMatrix),\n",
    "  (laurence)-[:ACTED_IN]->(theMatrix),\n",
    "  (carrie)-[:ACTED_IN]->(theMatrix)\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "329d3407aee616e7",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:54.915696400Z",
     "start_time": "2024-11-05T15:21:54.875696700Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'n': {'name': 'Keanu Reever'}}\n",
      "{'n': {'name': 'Laurence Fishburne'}}\n",
      "{'n': {'name': 'Tom Hanks'}}\n",
      "{'n': {'title': 'The Matrix'}}\n",
      "{'n': {'name': 'Carrie-Anne Moss'}}\n",
      "********************************\n",
      "{'n': {'name': 'Keanu Reever'}}\n",
      "{'n': {'name': 'Laurence Fishburne'}}\n",
      "{'n': {'title': 'The Matrix'}}\n",
      "{'n': {'name': 'Carrie-Anne Moss'}}\n"
     ]
    }
   ],
   "source": [
    "results = session.run(\"\"\"MATCH (n) RETURN n\"\"\")\n",
    "for record in results:\n",
    "    print(record.data())\n",
    "session.run(\"\"\"MATCH (n:Person {name: 'Tom Hanks'}) DELETE n\"\"\")\n",
    "print(\"********************************\")\n",
    "results = session.run(\"\"\"MATCH (n) RETURN n\"\"\")\n",
    "for record in results:\n",
    "    print(record.data())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "151e93f58565e4e5",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:55.006438Z",
     "start_time": "2024-11-05T15:21:54.904697200Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'a': {'name': 'Keanu Reever'}, 'r': ({'name': 'Keanu Reever'}, 'ACTED_IN', {'title': 'The Matrix'}), 'b': {'title': 'The Matrix'}}\n",
      "{'a': {'name': 'Laurence Fishburne'}, 'r': ({'name': 'Laurence Fishburne'}, 'ACTED_IN', {'title': 'The Matrix'}), 'b': {'title': 'The Matrix'}}\n",
      "{'a': {'name': 'Carrie-Anne Moss'}, 'r': ({'name': 'Carrie-Anne Moss'}, 'ACTED_IN', {'title': 'The Matrix'}), 'b': {'title': 'The Matrix'}}\n",
      "***************************************************\n",
      "{'a': {'name': 'Keanu Reever'}, 'r': ({'name': 'Keanu Reever'}, 'ACTED_IN', {'title': 'The Matrix'}), 'b': {'title': 'The Matrix'}}\n",
      "{'a': {'name': 'Carrie-Anne Moss'}, 'r': ({'name': 'Carrie-Anne Moss'}, 'ACTED_IN', {'title': 'The Matrix'}), 'b': {'title': 'The Matrix'}}\n"
     ]
    }
   ],
   "source": [
    "results = session.run(\"MATCH (a)-[r:ACTED_IN]->(b) RETURN a, r, b\")\n",
    "for record in results:\n",
    "    print(record.data())\n",
    "print(\"***************************************************\")\n",
    "session.run(\"\"\"MATCH (n:Person {name: 'Laurence Fishburne'})-[r:ACTED_IN]->() DELETE r\"\"\")\n",
    "results = session.run(\"MATCH (a)-[r:ACTED_IN]->(b) RETURN a, r, b\")\n",
    "for record in results:\n",
    "    print(record.data())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "74c21e354996cdeb",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:55.008441Z",
     "start_time": "2024-11-05T15:21:54.937709700Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'a': {'name': 'Keanu Reever'}, 'r': ({'name': 'Keanu Reever'}, 'ACTED_IN', {'title': 'The Matrix'}), 'b': {'title': 'The Matrix'}}\n",
      "{'a': {'name': 'Carrie-Anne Moss'}, 'r': ({'name': 'Carrie-Anne Moss'}, 'ACTED_IN', {'title': 'The Matrix'}), 'b': {'title': 'The Matrix'}}\n",
      "*****************************************************\n",
      "{'a': {'name': 'Keanu Reever'}, 'r': ({'name': 'Keanu Reever'}, 'ACTED_IN', {'title': 'The Matrix'}), 'b': {'title': 'The Matrix'}}\n"
     ]
    }
   ],
   "source": [
    "results = session.run(\"MATCH (a)-[r:ACTED_IN]->(b) RETURN a, r, b\")\n",
    "for record in results:\n",
    "    print(record.data())\n",
    "print(\"*****************************************************\")\n",
    "session.run(\"\"\"MATCH (n:Person {name: 'Carrie-Anne Moss'})\n",
    "                DETACH DELETE n\"\"\")\n",
    "results = session.run(\"MATCH (a)-[r:ACTED_IN]->(b) RETURN a, r, b\")\n",
    "for record in results:\n",
    "    print(record.data())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "a9b7722d5fb4841c",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:55.009438Z",
     "start_time": "2024-11-05T15:21:54.970335700Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'n': {'name': 'Keanu Reever'}}\n",
      "{'n': {'name': 'Laurence Fishburne'}}\n",
      "{'n': {'title': 'The Matrix'}}\n",
      "*********************************\n",
      "{'n': {'name': 'Robert'}}\n",
      "{'n': {'name': 'Keanu Reever'}}\n",
      "{'n': {'name': 'Laurence Fishburne'}}\n",
      "{'n': {'title': 'The Matrix'}}\n"
     ]
    }
   ],
   "source": [
    "print_nodes()\n",
    "session.run(\"\"\"MERGE (robert:Critic {name: \"Robert\"})\n",
    "    RETURN robert\"\"\")\n",
    "print(\"*********************************\")\n",
    "print_nodes()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "99ab49c7f1b8ab46",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:55.122608600Z",
     "start_time": "2024-11-05T15:21:55.000441Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'n': {'name': 'Robert'}}\n",
      "{'n': {'name': 'Keanu Reever'}}\n",
      "{'n': {'name': 'Laurence Fishburne'}}\n",
      "{'n': {'title': 'The Matrix'}}\n",
      "*********************************\n",
      "{'n': {'name': 'Robert'}}\n",
      "{'n': {'name': 'Keanu Reever'}}\n",
      "{'n': {'name': 'Laurence Fishburne'}}\n",
      "{'n': {'title': 'The Matrix'}}\n"
     ]
    }
   ],
   "source": [
    "print_nodes()\n",
    "session.run(\"\"\"MERGE (robert:Critic {name: \"Robert\"})\n",
    "    RETURN robert\"\"\")\n",
    "print(\"*********************************\")\n",
    "print_nodes()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "f8825f1d7bf324f4",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:55.144601400Z",
     "start_time": "2024-11-05T15:21:55.033437600Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'n': {'name': 'Andy'}}\n",
      "{'n': {'name': 'Sara'}}\n"
     ]
    }
   ],
   "source": [
    "session.run(\"MATCH (n) DETACH DELETE n\")\n",
    "session.run(\"CREATE (n:Swedish {name: 'Andy'}), (m:German {name: 'Sara'})\")\n",
    "print_nodes()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "6e4f13f20a67cf54",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:55.146608500Z",
     "start_time": "2024-11-05T15:21:55.064600300Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'n.name': 'Andy', 'n.surname': 'Taylor'}]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = session.run(\"\"\"MATCH (n {name: 'Andy'})\n",
    "            SET n.surname = 'Taylor'\n",
    "            RETURN n.name, n.surname\"\"\")\n",
    "results.data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "d091f709fe6bef9a",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:55.147599300Z",
     "start_time": "2024-11-05T15:21:55.080601100Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x1ea8b3cc8e0>"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "session.run(\"\"\"MATCH(n {name: 'Andy'}), (m:German {name: 'Sara'})\n",
    "            CREATE (n)-[r:KNOWS]->(m)\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "fdc4aed2a2fdb867",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:55.148600400Z",
     "start_time": "2024-11-05T15:21:55.094599500Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'n': {'surname': 'Taylor', 'name': 'Andy'},\n",
       "  'r': ({'surname': 'Taylor', 'name': 'Andy'}, 'KNOWS', {'name': 'Sara'}),\n",
       "  'm': {'name': 'Sara'},\n",
       "  'r.since': 1999}]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = session.run(\"\"\"MATCH (n:Swedish {name: 'Andy'})-[r:KNOWS]->(m:German {name: 'Sara'})\n",
    "                        SET r.since = 1999\n",
    "                        RETURN n, r, m, r.since\"\"\")\n",
    "results.data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "ed5783cd707deb44",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:55.163601200Z",
     "start_time": "2024-11-05T15:21:55.111602200Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'n': {'propTestValue1': 42, 'name': 'Andy', 'age': 36},\n",
       "  'labels(n)': ['Swedish']},\n",
       " {'n': {'propTestValue2': 42, 'name': 'Timothy', 'age': 25},\n",
       "  'labels(n)': ['Swedish']},\n",
       " {'n': {'name': 'Peter', 'age': 34}, 'labels(n)': ['Swedish', 'German']}]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "session.run(\"MATCH (n) DETACH DELETE n\")\n",
    "session.run(\"\"\"CREATE\n",
    "  (a:Swedish {name: 'Andy', age: 36, propTestValue1: 42}),\n",
    "  (t:Swedish {name: 'Timothy', age: 25, propTestValue2: 42}),\n",
    "  (p:German:Swedish {name: 'Peter', age: 34}),\n",
    "  (a)-[:KNOWS]->(t),\n",
    "  (a)-[:KNOWS]->(p)\"\"\")\n",
    "results = session.run(\"MATCH (n) RETURN n, labels(n)\")\n",
    "results.data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "21533e46234947b8",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:55.292375400Z",
     "start_time": "2024-11-05T15:21:55.145606100Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'a.name': 'Andy', 'a.age': None}]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = session.run(\"\"\"MATCH (a {name: 'Andy'})\n",
    "                REMOVE a.age\n",
    "                 RETURN a.name, a.age\"\"\")\n",
    "results.data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "fdd0e1e41b3df702",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:55.316798500Z",
     "start_time": "2024-11-05T15:21:55.158600400Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'n.name': 'Andy', 'n.age': None},\n",
       " {'n.name': 'Peter', 'n.age': 34},\n",
       " {'n.name': 'Timothy', 'n.age': 25}]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = session.run(\"\"\"MATCH (n)\n",
    "                RETURN n.name, n.age\n",
    "                ORDER BY n.name ASC\"\"\")\n",
    "results.data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "6c8142d799e6600a",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:55.317794900Z",
     "start_time": "2024-11-05T15:21:55.175600500Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'n': {'name': 'Bob'}}\n",
      "{'n': {'name': 'Charlie'}}\n",
      "{'n': {'name': 'Alice'}}\n"
     ]
    }
   ],
   "source": [
    "session.run(\"MATCH (n) DETACH DELETE n\")\n",
    "session.run(\"\"\"WITH [\"Alice\", \"Bob\", \"Charlie\"] AS names\n",
    "        FOREACH (name IN names | CREATE (n:Person {name: name}))\"\"\")\n",
    "print_nodes()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "bd742b226209f383",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:55.318793800Z",
     "start_time": "2024-11-05T15:21:55.207601400Z"
    },
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "session.close()\n",
    "driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "7ed964dead296466",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:55.319803700Z",
     "start_time": "2024-11-05T15:21:55.223601300Z"
    },
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "from neomodel import (config, StructuredNode, StringProperty, IntegerProperty,\n",
    "    UniqueIdProperty, RelationshipTo)\n",
    "config.DATABASE_URL = \"bolt://neo4j:12345678@localhost:7687/neomodelexample\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "23d698bc439b7f80",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:55.319803700Z",
     "start_time": "2024-11-05T15:21:55.253604100Z"
    },
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "class Country(StructuredNode):\n",
    "    code = StringProperty(unique_index=True, required=True)\n",
    "\n",
    "class City(StructuredNode):\n",
    "    name = StringProperty(required=True)\n",
    "    country = RelationshipTo(Country, 'FROM_COUNTRY')\n",
    "\n",
    "class Person(StructuredNode):\n",
    "    uid = UniqueIdProperty()\n",
    "    name = StringProperty(unique_index=True)\n",
    "    age = IntegerProperty(index=True, default=0)\n",
    "\n",
    "    # traverse outgoing IS_FROM relations, inflate to Country objects\n",
    "    country = RelationshipTo(Country, 'IS_FROM')\n",
    "\n",
    "    # traverse outgoing LIVES_IN relations, inflate to City objects\n",
    "    city = RelationshipTo(City, 'LIVES_IN')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "902e0460c7626a83",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:57.358845Z",
     "start_time": "2024-11-05T15:21:55.270602200Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'uid': '5af598ecf9394884a2186120a3a16cd3', 'name': 'Jim', 'age': 3, 'element_id_property': '4:d3fcd08f-326d-481d-9a7b-3c5054005912:3'}\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "from neomodel import db\n",
    "db.cypher_query(\"MATCH (n) DETACH DELETE n\")\n",
    "# 创建节点\n",
    "jim = Person(name='Jim', age=3).save() # Create\n",
    "print(jim)\n",
    "print(jim.age)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "e6481a90b3abce1d",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:57.392852800Z",
     "start_time": "2024-11-05T15:21:57.356842800Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "5"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "jim.age = 5\n",
    "jim.save() # Update, (with validation)\n",
    "jim.age\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "55b414d6512da057",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:57.409842900Z",
     "start_time": "2024-11-05T15:21:57.372844300Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[<Person: {'uid': '5af598ecf9394884a2186120a3a16cd3', 'name': 'Jim', 'age': 5, 'element_id_property': '4:d3fcd08f-326d-481d-9a7b-3c5054005912:3'}>, <Person: {'uid': '8e56b9d20179434e853025c6b97e6649', 'name': 'Bob', 'age': 5, 'element_id_property': '4:d3fcd08f-326d-481d-9a7b-3c5054005912:4'}>]\n"
     ]
    }
   ],
   "source": [
    "Person(name='Bob', age=5).save()\n",
    "all_nodes = Person.nodes.all()\n",
    "print(all_nodes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "97d08f9582e179",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:57.447857200Z",
     "start_time": "2024-11-05T15:21:57.406843500Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Person: {'uid': '5af598ecf9394884a2186120a3a16cd3', 'name': 'Jim', 'age': 5, 'element_id_property': '4:d3fcd08f-326d-481d-9a7b-3c5054005912:3'}>"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "jim = Person.nodes.get(name='Jim')\n",
    "jim"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "6c7eaff199d06a73",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:57.464844200Z",
     "start_time": "2024-11-05T15:21:57.420846900Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Country: {'code': 'DE', 'element_id_property': '4:d3fcd08f-326d-481d-9a7b-3c5054005912:5'}>]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "germany = Country(code='DE').save()\n",
    "jim.country.connect(germany)\n",
    "jim.country.all()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "5420dcbbf3fc5cce",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:57.522855300Z",
     "start_time": "2024-11-05T15:21:57.451846300Z"
    },
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "jim.country.disconnect(germany)\n",
    "jim.country.all()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "ac60f2a2941c2dbd",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2024-11-05T15:21:57.523843200Z",
     "start_time": "2024-11-05T15:21:57.483843600Z"
    },
    "collapsed": false
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
